# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [5,6, 8,14, 15,11]  #4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
    # Shuffle_Block: [out, stride]
  [ [-1, 1, conv_bn_relu_maxpool, [ 32 ]], # 0-P2/4
    [-1, 1, Shuffle_Block, [ 128, 2 ]],  # 1-P3/8
    [-1, 3, Shuffle_Block, [ 128, 1 ]],  # 2
    [-1, 1, Shuffle_Block, [ 256, 2 ]],  # 3-P4/16
    [-1, 3, Shuffle_Block, [ 256, 1 ]],  # 4
    [-1, 1, Shuffle_Block, [ 512, 2 ]],  # 5-P5/32
    [-1, 3, Shuffle_Block, [ 512, 1 ]],  # 6
    [-1, 1, SPPF, [ 1024, 5 ] ],  # 7

  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]], #20*20 8
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 40*40
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 11

   [-1, 1, Conv, [512, 1, 1]], #40*40 12
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #13
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3   80*80
   [-1, 3, C3, [512, False]],  # 15 (P3/8-small)  80*80

   [-1, 1, Conv, [256, 1, 1]], #16  80*80
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #17 160*160
   [[-1, 2], 1, Concat, [1]],  #18 cat backbone p2  160*160
   [-1, 3, C3, [256, False]],  #19 160*160

   [-1, 1, Conv, [256, 3, 2]], #20 80*80
   [[-1, 16], 1, Concat, [1]], #21 80*80
   [-1, 3, C3, [256, False]],  # 22 
   [-1, 1, Conv, [256, 3, 2]], #23   40*40
   [[-1, 12], 1, Concat, [1]], #24 cat head P4  40*40
   [-1, 3, C3, [512, False]],  # 25 (P4/16-medium) 40*40

   [-1, 1, Conv, [512, 3, 2]],  #26  20*20
   [[-1, 8], 1, Concat, [1]],  #27 cat head P5  20*20
   [-1, 3, C3, [1024, False]],  # 28 (P5/32-large)  20*20
   [-1, 1, SKAttention, [1024]],  #SKA 29


   [[19, 22, 25, 29], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
